app/Models/Client_model.php

    public function getClient()
    {
        $builder = $this->db->table('client');
        $builder->select('*');
        return $builder->get();
---
SELECT *
FROM `client`

    public function saveClient($data){
        $query = $this->db->table('client')->insert($data);
---
INSERT INTO `client` (`client_firstname`, `client_lastname`, `client_email`) VALUES ('Carolina', 'Viloria', 'maria@valles.com')

    public function deleteClient($id)
    {
        $query = $this->db->table('client')->delete(array('client_id' => $id));
---
DELETE FROM `client`
WHERE `client_id` = '7'